@jmorrowomni I followed your steps and ends up with following plan output:

```bash
Terraform will perform the following actions:

  # azurerm_sentinel_alert_rule_ms_security_incident.sentinel_adrule must be replaced
-/+ resource "azurerm_sentinel_alert_rule_ms_security_incident" "sentinel_adrule" {
        display_name               = "Azure Sentinel Rule for Azure Active Directory created by Terraform"
      ~ display_name_filter        = [] -> (known after apply)
        enabled                    = true
      ~ id                         = "/subscriptions/***/resourceGroups/sentinel-example-resources/providers/Microsoft.OperationalInsights/workspaces/sentinel-example-workspace/providers/Microsoft.SecurityInsights/alertRules/ms-security-incident-alert-active-directory-v6" -> (known after apply)
        log_analytics_workspace_id = "/subscriptions/***/resourcegroups/sentinel-example-resources/providers/microsoft.operationalinsights/workspaces/sentinel-example-workspace"
      ~ name                       = "ms-security-incident-alert-active-directory-v6" -> "ms-security-incident-alert-active-directory-v7" # forces replacement
        product_filter             = "Azure Active Directory Identity Protection"
        severity_filter            = [
            "High",
            "Low",
            "Medium",
        ]
      ~ text_whitelist             = [] -> (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
Would you please also send out the plan output together with the debug log here? Thanks!